In [1]:
import pandas as pd
import numpy as np

In [10]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(data=np.random.randn(6, 4), index=dates, 
                 columns=["A", "B", "C", "D"])
df

                   A         B         C         D
2013-01-01 -0.575582 -1.470585  1.303318  0.257549
2013-01-02  0.064834 -0.894528 -0.605272 -1.189461
2013-01-03 -0.304427  0.556623 -0.444691 -1.615134
2013-01-04 -0.225695 -1.257050  1.241516 -1.378007
2013-01-05  1.760031  0.922599 -0.230582 -0.332199
2013-01-06 -0.431299 -0.592798 -0.271483 -0.590120

In [11]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [12]:
df["F"] = s1
df

                   A         B         C         D    F
2013-01-01 -0.575582 -1.470585  1.303318  0.257549  NaN
2013-01-02  0.064834 -0.894528 -0.605272 -1.189461  1.0
2013-01-03 -0.304427  0.556623 -0.444691 -1.615134  2.0
2013-01-04 -0.225695 -1.257050  1.241516 -1.378007  3.0
2013-01-05  1.760031  0.922599 -0.230582 -0.332199  4.0
2013-01-06 -0.431299 -0.592798 -0.271483 -0.590120  5.0

In [13]:
df.at[dates[0], "A"]

-0.5755816399441818

In [15]:
df.iat[0, 1] = 0

In [17]:
df.loc[:, "D"] = np.array([5] * len(df))

In [22]:
df

                   A         B         C  D    F
2013-01-01 -0.575582  0.000000  1.303318  5  NaN
2013-01-02  0.064834 -0.894528 -0.605272  5  1.0
2013-01-03 -0.304427  0.556623 -0.444691  5  2.0
2013-01-04 -0.225695 -1.257050  1.241516  5  3.0
2013-01-05  1.760031  0.922599 -0.230582  5  4.0
2013-01-06 -0.431299 -0.592798 -0.271483  5  5.0

In [23]:
df2 = df.copy()

In [25]:
df2[df2 > 0] = -df2

In [27]:
df2 = df.copy()

In [28]:
df2

                   A         B         C  D    F
2013-01-01 -0.575582  0.000000  1.303318  5  NaN
2013-01-02  0.064834 -0.894528 -0.605272  5  1.0
2013-01-03 -0.304427  0.556623 -0.444691  5  2.0
2013-01-04 -0.225695 -1.257050  1.241516  5  3.0
2013-01-05  1.760031  0.922599 -0.230582  5  4.0
2013-01-06 -0.431299 -0.592798 -0.271483  5  5.0

In [29]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+["E"])
df1

                   A         B         C  D    F   E
2013-01-01 -0.575582  0.000000  1.303318  5  NaN NaN
2013-01-02  0.064834 -0.894528 -0.605272  5  1.0 NaN
2013-01-03 -0.304427  0.556623 -0.444691  5  2.0 NaN
2013-01-04 -0.225695 -1.257050  1.241516  5  3.0 NaN

In [31]:
df1.loc[dates[0] : dates[1], "E"] = 1

In [32]:
df1

                   A         B         C  D    F    E
2013-01-01 -0.575582  0.000000  1.303318  5  NaN  1.0
2013-01-02  0.064834 -0.894528 -0.605272  5  1.0  1.0
2013-01-03 -0.304427  0.556623 -0.444691  5  2.0  NaN
2013-01-04 -0.225695 -1.257050  1.241516  5  3.0  NaN

In [33]:
df1.dropna(how="any")

                   A         B         C  D    F    E
2013-01-02  0.064834 -0.894528 -0.605272  5  1.0  1.0

In [34]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01 -0.575582  0.000000  1.303318  5  5.0  1.0
2013-01-02  0.064834 -0.894528 -0.605272  5  1.0  1.0
2013-01-03 -0.304427  0.556623 -0.444691  5  2.0  5.0
2013-01-04 -0.225695 -1.257050  1.241516  5  3.0  5.0

In [35]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [36]:
df.mean()

A    0.047977
B   -0.210859
C    0.165468
D    5.000000
F    3.000000
dtype: float64

In [39]:
df.mean(1)

2013-01-01    1.431934
2013-01-02    0.913007
2013-01-03    1.361501
2013-01-04    1.551754
2013-01-05    2.290410
2013-01-06    1.740884
Freq: D, dtype: float64

In [49]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [53]:
df.sub(s, axis=0)

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.304427 -0.443377 -1.444691  4.0  1.0
2013-01-04 -3.225695 -4.257050 -1.758484  2.0  0.0
2013-01-05 -3.239969 -4.077401 -5.230582  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [51]:
df

                   A         B         C  D    F
2013-01-01 -0.575582  0.000000  1.303318  5  NaN
2013-01-02  0.064834 -0.894528 -0.605272  5  1.0
2013-01-03 -0.304427  0.556623 -0.444691  5  2.0
2013-01-04 -0.225695 -1.257050  1.241516  5  3.0
2013-01-05  1.760031  0.922599 -0.230582  5  4.0
2013-01-06 -0.431299 -0.592798 -0.271483  5  5.0

In [54]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01 -0.575582  0.000000  1.303318   5   NaN
2013-01-02 -0.510747 -0.894528  0.698046  10   1.0
2013-01-03 -0.815175 -0.337905  0.253354  15   3.0
2013-01-04 -1.040870 -1.594954  1.494870  20   6.0
2013-01-05  0.719160 -0.672355  1.264289  25  10.0
2013-01-06  0.287862 -1.265152  0.992806  30  15.0

In [55]:
df.apply(lambda x:x.max()-x.min())

A    2.335612
B    2.179649
C    1.908590
D    0.000000
F    4.000000
dtype: float64

In [56]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.587066  0.219728  0.813032  0.080461
1 -0.332116  0.820233 -1.179038  0.305403
2  1.095910 -0.335384 -0.725198 -2.461764
3 -0.127621 -0.150319 -0.081518 -0.934779
4  1.056082  0.788590  0.530247  0.697289
5  2.095851  1.248616 -0.838520  0.242704
6  0.033536 -0.053660  0.334402  1.035416
7 -0.495402 -0.812599  1.001293  1.135542
8 -0.766625 -1.643818  0.224261  1.437786
9  0.219816  0.841996  0.821859  0.258684

In [57]:
pieces = [df[:3], df[3:7], df[7:]]

In [63]:
pd.concat(pieces, axis = 1)

,0,1,2,3,0,1,2,3,0,1,2,3
0,0.587066,0.219728,0.813032,0.080461,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,-0.332116,0.820233,-1.179038,0.305403,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1.095910,-0.335384,-0.725198,-2.461764,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,-0.127621,-0.150319,-0.081518,-0.934779,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,1.056082,0.788590,0.530247,0.697289,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,2.095851,1.248616,-0.838520,0.242704,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,0.033536,-0.053660,0.334402,1.035416,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,-0.495402,-0.812599,1.001293,1.135542
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,-0.766625,-1.643818,0.224261,1.437786
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.219816,0.841996,0.821859,0.258684

In [66]:
left = pd.DataFrame({'key':["foo","foo"], "lval":[1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [67]:
right = pd.DataFrame({"key":["foo", "foo"], "rval":[4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [68]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [73]:
df = pd.DataFrame(
    {
        "A":["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"], 
        "B":["one", "one", "two", "three", "two", "two", "one", "three"], 
        "C":np.random.randn(8), 
        "D":np.random.randn(8),
    })
df

     A      B         C         D
0  foo    one -0.591338  0.901900
1  bar    one  0.248945  0.636150
2  foo    two  0.267288 -0.369826
3  bar  three  0.408282 -0.451048
4  foo    two -0.364497 -1.512807
5  bar    two -0.094067 -1.088921
6  foo    one  0.242095  1.781485
7  foo  three -0.238471 -0.582958

In [74]:
df.groupby("A").sum()

            C         D
A
bar  0.563160 -0.903819
foo -0.684923  0.217794

In [75]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one    0.248945  0.636150
    three  0.408282 -0.451048
    two   -0.094067 -1.088921
foo one   -0.349243  2.683385
    three -0.238471 -0.582958
    two   -0.097209 -1.882633

In [76]:
tuples = list(
    zip(
        *[
            ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"], 
            ["one", "two", "one", "two", "one", "two", "one", "two"]
        ]))

In [77]:
index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])